app/views/pokemon/_pokemon.json.jbuilder

if display_toys
  json.toys pokemon.toys.each do |toy|
---
SELECT "toys".* FROM "toys"  WHERE "toys"."pokemon_id" = $1  [["pokemon_id", 1]]